-- MySQL dump 10.13  Distrib 8.0.25, for Win64 (x86_64)
--
-- Host: localhost    Database: hakaton
-- ------------------------------------------------------
-- Server version	8.0.25

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `item`
--

DROP TABLE IF EXISTS `item`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `item` (
  `Id` int NOT NULL AUTO_INCREMENT,
  `ItemName` varchar(32) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `ItemType` varchar(8) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT 'Лето',
  `ItemStatus` int NOT NULL DEFAULT '1',
  `RentalPointId` int NOT NULL,
  PRIMARY KEY (`Id`),
  KEY `RentalPointId` (`RentalPointId`),
  CONSTRAINT `item_ibfk_1` FOREIGN KEY (`RentalPointId`) REFERENCES `rentalpoint` (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=260 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `item`
--

LOCK TABLES `item` WRITE;
/*!40000 ALTER TABLE `item` DISABLE KEYS */;
INSERT INTO `item` VALUES (130,'Велосипед','Лето',1,1),(131,'Велосипед','Лето',1,1),(132,'Велосипед','Лето',1,1),(133,'Велосипед','Лето',1,1),(134,'Велосипед','Лето',1,1),(135,'Велосипед','Лето',1,1),(136,'Велосипед','Лето',1,1),(137,'Велосипед','Лето',1,1),(138,'Велосипед','Лето',1,1),(139,'Велосипед','Лето',1,1),(140,'Велосипед','Лето',1,2),(141,'Велосипед','Лето',1,2),(142,'Велосипед','Лето',1,2),(143,'Велосипед','Лето',1,2),(144,'Велосипед','Лето',1,2),(145,'Велосипед','Лето',1,2),(146,'Велосипед','Лето',1,2),(147,'Велосипед','Лето',1,2),(148,'Велосипед','Лето',1,2),(149,'Велосипед','Лето',1,2),(150,'Велосипед','Лето',1,2),(151,'Велосипед','Лето',1,2),(152,'Велосипед','Лето',1,3),(153,'Велосипед','Лето',1,3),(154,'Велосипед','Лето',1,3),(155,'Велосипед','Лето',1,3),(156,'Велосипед','Лето',1,3),(157,'Велосипед','Лето',1,3),(158,'Велосипед','Лето',1,3),(159,'Велосипед','Лето',1,3),(160,'Велосипед','Лето',1,3),(161,'Велосипед','Лето',1,3),(162,'Велосипед','Лето',1,3),(163,'Велосипед','Лето',1,3),(164,'Велосипед','Лето',1,3),(165,'Велосипед','Лето',1,3),(166,'Велосипед','Лето',1,3),(167,'Велосипед','Лето',1,3),(168,'Велосипед','Лето',1,3),(169,'Велосипед','Лето',1,3),(170,'Велосипед','Лето',1,3),(171,'Велосипед','Лето',1,3),(172,'Велосипед','Лето',1,3),(173,'Велосипед','Лето',1,4),(174,'Велосипед','Лето',1,4),(175,'Велосипед','Лето',1,4),(176,'Велосипед','Лето',1,4),(177,'Велосипед','Лето',1,4),(178,'Велосипед','Лето',1,4),(179,'Велосипед','Лето',1,4),(180,'Велосипед','Лето',1,4),(181,'Велосипед','Лето',1,4),(182,'Велосипед','Лето',1,4),(183,'Велосипед','Лето',1,4),(184,'Велосипед','Лето',1,4),(185,'Велосипед','Лето',1,4),(186,'Велосипед','Лето',1,5),(187,'Велосипед','Лето',1,5),(188,'Велосипед','Лето',1,5),(189,'Велосипед','Лето',1,5),(190,'Велосипед','Лето',1,5),(191,'Велосипед','Лето',1,5),(192,'Велосипед','Лето',1,5),(193,'Велосипед','Лето',1,5),(194,'Велосипед','Лето',1,5),(195,'Велосипед','Лето',1,5),(196,'Велосипед','Лето',1,5),(197,'Велосипед','Лето',1,5),(198,'Велосипед','Лето',1,5),(199,'Велосипед','Лето',1,5),(200,'Самокат','Лето',1,1),(201,'Самокат','Лето',1,1),(202,'Самокат','Лето',1,1),(203,'Самокат','Лето',1,1),(204,'Самокат','Лето',1,1),(205,'Самокат','Лето',1,1),(206,'Самокат','Лето',1,1),(207,'Самокат','Лето',1,1),(208,'Самокат','Лето',1,1),(209,'Самокат','Лето',1,1),(210,'Самокат','Лето',1,2),(211,'Самокат','Лето',1,2),(212,'Самокат','Лето',1,2),(213,'Самокат','Лето',1,2),(214,'Самокат','Лето',1,2),(215,'Самокат','Лето',1,2),(216,'Самокат','Лето',1,2),(217,'Самокат','Лето',1,2),(218,'Самокат','Лето',1,2),(219,'Самокат','Лето',1,2),(220,'Самокат','Лето',1,3),(221,'Самокат','Лето',1,3),(222,'Самокат','Лето',1,3),(223,'Самокат','Лето',1,3),(224,'Самокат','Лето',1,3),(225,'Самокат','Лето',1,3),(226,'Самокат','Лето',1,3),(227,'Самокат','Лето',1,3),(228,'Самокат','Лето',1,3),(229,'Самокат','Лето',1,3),(230,'Самокат','Лето',1,3),(231,'Самокат','Лето',1,3),(232,'Самокат','Лето',1,3),(233,'Самокат','Лето',1,4),(234,'Самокат','Лето',1,4),(235,'Самокат','Лето',1,4),(236,'Самокат','Лето',1,4),(237,'Самокат','Лето',1,4),(238,'Самокат','Лето',1,4),(239,'Самокат','Лето',1,4),(240,'Самокат','Лето',1,4),(241,'Самокат','Лето',1,4),(242,'Самокат','Лето',1,4),(243,'Самокат','Лето',1,4),(244,'Самокат','Лето',1,5),(245,'Самокат','Лето',1,5),(246,'Самокат','Лето',1,5),(247,'Самокат','Лето',1,5),(248,'Самокат','Лето',1,5),(249,'Самокат','Лето',1,5),(250,'Самокат','Лето',1,5),(251,'Самокат','Лето',1,5),(252,'Самокат','Лето',1,5),(253,'Самокат','Лето',1,5),(254,'Самокат','Лето',1,5),(255,'Самокат','Лето',1,5),(256,'Самокат','Лето',1,5),(257,'Самокат','Лето',1,5),(258,'Самокат','Лето',1,5),(259,'Самокат','Лето',1,5);
/*!40000 ALTER TABLE `item` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-05-23  9:21:14
